{
  "backend/main.mo": "Motoko backend managing user access control, profiles, and single candidate records with pipeline stages and idempotent user-access initialization.",
  "feature_evidence.json": "Feature evidence report listing feature requests, affected files, components, and confidence indicators.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, bootstrap gating, role‑intent routing, and switching between candidate and recruiter views.",
  "frontend/src/components/AdminPage.tsx": "Empty placeholder file for the admin page component.",
  "frontend/src/components/ApiDocsPage.tsx": "Empty placeholder file for the API documentation page component.",
  "frontend/src/components/AuthenticatedLoadingScreen.tsx": "Loading UI shown during authenticated bootstrap with skeleton placeholders.",
  "frontend/src/components/BackendInfoBar.tsx": "Displays backend canister ID and API base URL with copy‑to‑clipboard buttons.",
  "frontend/src/components/CandidatesPage.tsx": "Candidate self-service page handling authentication, profile setup, and CRUD actions on the user's own candidate application.",
  "frontend/src/components/InitializationErrorPanel.tsx": "Displays initialization errors with retry, copyable technical details, and expandable debug info.",
  "frontend/src/components/RecruiterPage.tsx": "Recruiter/admin view with authentication, role checks, and UI for managing all candidates and pipeline stages.",
  "frontend/src/components/RoleSelectionCard.tsx": "Landing card allowing users to choose candidate or recruiter role intent before login.",
  "frontend/src/components/SchemaDiagramPage.tsx": "Empty or placeholder component for displaying a schema diagram.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAppBootstrap.ts": "Central bootstrap logic determining authenticated state, actor readiness, role availability, and error handling.",
  "frontend/src/hooks/useCandidates.ts": "React Query hooks for fetching and mutating candidate data, including CRUD operations and pipeline stage updates.",
  "frontend/src/hooks/useEnsureBaselineUserAccess.ts": "Provides a mutation hook that calls actor.ensureUserAccess and tracks attempt state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider with login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useRoleIntent.ts": "Stores and retrieves a user's role intent in sessionStorage with setter and clear helpers.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor tied to the current identity and optionally initializes admin access from URL parameters.",
  "frontend/src/hooks/useUserAccess.ts": "Exposes queries for caller role and admin status using the safe actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides queries and mutations for fetching and saving the caller's user profile.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/backendUrl.ts": "Builds backend canister URLs for local and production environments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, containers, and animations.",
  "project_state.json": "Defines current project state for fixing bootstrap initialization errors and improving diagnostics, listing existing issues and three related feature requirements."
}
